#include "Game.h"

//==============================
// ゲーム実行
//==============================
int Game::Run()
{
	//=================
	// ゲーム初期化
	//=================
	if (!Initialize())
	{
		return -1;
	}

	//=================
	// ゲームループ
	//=================
	while (true)
	{
		// メッセージ処理
		if (!m_window->ProcessMessage())
		{
			break;
		}

		// ゲーム更新
		Update();

		// ゲーム描画
		Draw();

	}
	
	//=================
	// ゲーム終了
	//=================
	Finalize();

	return 0;
}

//==============================
// ゲーム初期化
//==============================
bool Game::Initialize()
{
	//=================
	// ウィンドウ生成
	//=================
	m_window = std::make_unique<Window>();
	
	if (!m_window->Create(L"BEAT BREAKER", 1280, 720))
	{
		return false;
	}

	return true;

}

//==============================
// ゲーム終了
//==============================
void Game::Finalize()
{
	// ウィンドウ破棄
	m_window.reset();
}

//==============================
// ゲーム更新
//==============================
void Game::Update()
{

}

//==============================
// ゲーム描画
//==============================
void Game::Draw()
{

}

